```
krishna@turbotindias-MacBook-Pro gcp_check_iam % terraform apply --var-file=demo.tfvars  
var.turbot_profile
  Enter profile matching your turbot cli credentials.

  Enter a value: punisher


An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # turbot_policy_setting.iam_service_account_policy_trusted_access[0] will be created
  + resource "turbot_policy_setting" "iam_service_account_policy_trusted_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-iam#/policy/types/serviceAccountPolicyTrustedAccess"
      + value                        = "Check: Trusted Access > *"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.service_account_key_active[0] will be created
  + resource "turbot_policy_setting" "service_account_key_active" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-iam#/policy/types/serviceAccountKeyActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.service_account_key_active_age[0] will be created
  + resource "turbot_policy_setting" "service_account_key_active_age" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-iam#/policy/types/serviceAccountKeyActiveAge"
      + value                        = "Force inactive if age > 90 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_smart_folder.gcp_iam will be created
  + resource "turbot_smart_folder" "gcp_iam" {
      + description = "Defines sets of policies for the GCP Check IAM baseline"
      + id          = (known after apply)
      + parent      = "tmod:@turbot/turbot#/"
      + parent_akas = (known after apply)
      + title       = "GCP Check IAM Policies"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + enable_service_account_key_active_age_policies        = true
  + enable_service_account_key_active_policies            = true
  + enable_service_account_policy_trusted_access_policies = true
  + smart_folder_description                              = "Defines sets of policies for the GCP Check IAM baseline"
  + smart_folder_name                                     = "GCP Check IAM Policies"
  + smart_folder_parent_resource                          = "tmod:@turbot/turbot#/"
  + turbot_profile                                        = "punisher"

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

turbot_smart_folder.gcp_iam: Creating...
turbot_smart_folder.gcp_iam: Creation complete after 2s [id=216669060934863]
turbot_policy_setting.service_account_key_active_age[0]: Creating...
turbot_policy_setting.iam_service_account_policy_trusted_access[0]: Creating...
turbot_policy_setting.service_account_key_active[0]: Creating...
turbot_policy_setting.service_account_key_active_age[0]: Creation complete after 2s [id=216669063427290]
turbot_policy_setting.iam_service_account_policy_trusted_access[0]: Creation complete after 2s [id=216669063433437]
turbot_policy_setting.service_account_key_active[0]: Creation complete after 2s [id=216669063231700]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

Outputs:

enable_service_account_key_active_age_policies = true
enable_service_account_key_active_policies = true
enable_service_account_policy_trusted_access_policies = true
smart_folder_description = Defines sets of policies for the GCP Check IAM baseline
smart_folder_name = GCP Check IAM Policies
smart_folder_parent_resource = tmod:@turbot/turbot#/
turbot_profile = punisher